{
  "range": "CURRENT!A1:P1022",
  "majorDimension": "ROWS",
  "values": [
    [
      "id",
      "order",
      "day",
      "bkgrnd",
      "start",
      "end",
      "room",
      "type",
      "name",
      "speaker",
      "description",
      "speakerLink",
      "slideLink",
      "",
      "color",
      "sessionImage"
    ],
    [
      "1",
      "1",
      "1",
      "blue",
      "8:30 AM",
      "9:00 AM",
      "Marriott Center ",
      "Reception",
      "Registration & Reception",
      "Sponsored by Last Call Media",
      "\u003cp\u003eRegistration and continental breakfast\u003c/p\u003e",
      "",
      "",
      "-"
    ],
    [
      "2",
      "2",
      "1",
      "blue",
      "9:00 AM",
      "9:15 AM",
      "Marriott Center ",
      "Welcome",
      "Opening Remarks",
      "Rick Hood, Kelly Albrecht",
      "\u003cp\u003ePlease attend the welcome session for information and orientation about today's schedule.\u003c/p\u003e\n\u003cp\u003eNOTE: RAFFLING OFF THREE EVERYDAY CHAOS BOOKS BY TODAY'S KEYNOTE DAVID WEINBERGER\u003c/p\u003e",
      "",
      "",
      "-"
    ],
    [
      "drupal",
      "3",
      "1",
      "white",
      "9:00 AM",
      "10:00 AM",
      "803",
      "Group discussion",
      "Drupal Usability Meeting",
      "Benji Fisher",
      "\u003cp\u003eNote: since this room was free, the Drupal Usability Meeting will take place here.\u003c/p\u003e\n\u003cp\u003eThis meeting takes place every Friday at 14:00 UTC (currently 6:00am PT, 9:00am ET)\u003c/p\u003e\n\u003cp\u003eReference: \u003ca href=\"https://www.drupal.org/community/contributor-guide/task/participate-in-a-usability-meeting\"\u003eParticipate in a Usability meeting\u003c/a\u003e.\u003c/p\u003e   "
    ],
    [
      "4",
      "4",
      "1",
      "white",
      "9:30 AM",
      "10:15 AM",
      "804",
      "Workshop",
      "Open Room",
      "Feel free to use this room.",
      "\u003cp\u003eFeel free to use this room if you like.\u003c/p\u003e"
    ],
    [
      "stanclift",
      "5",
      "1",
      "white",
      "9:30 AM",
      "10:15 AM",
      "805",
      "Talk",
      "AI in the Hiring Process",
      "Heidi Stanclift, Gretchen Duhaime, Lynn Schumman, Ang Buxton",
      "\u003cp\u003eThe hiring process has changed again. Applicants now use AI to apply, answer questions and anything else to get foot in the door. How do you sift through all this information to find the people that are truly interested in your opening?\u003c/p\u003e"
    ],
    [
      "peck",
      "6",
      "1",
      "white",
      "9:30 AM",
      "10:15 AM",
      "903",
      "Talk",
      "Shade and Shape: An Introduction to Vertex Shaders to Make Computerized Art",
      "Jeff Peck",
      "\u003cp\u003eDiscover how you can use WebGL to model three dimensional shapes to make art in your web browser. And don’t worry if you don’t know what “WebGL” is. We will cover that and more.\u003c/p\u003e\n\u003cp\u003eWe will delve into rendering primitive shapes with depth and lighting, adding noise functions, modeling real objects, and interactivity.\u003c/p\u003e\n\u003cp\u003eThis is a session for beginners and is intended to demonstrate things that are possible, and very much within reach of anyone who is interested in exploring.\u003c/p\u003e\n\u003cp\u003eBasic understanding of programming concepts, and in particular Javascript, will be helpful, but is not required.\u003c/p\u003e"
    ],
    [
      "ai-coding",
      "7",
      "1",
      "white",
      "9:30 AM",
      "5:00 PM",
      "904",
      "Workshop",
      "CANCELLED -- WORKSHOP: AI-Enhanced Coding: A Practical Workshop for All Levels  (Full Day)",
      "Michael Miles",
      "\u003cp\u003eSorry, cancelled on March 6 due to only 1 signup at that point.  See Mike's talk on Saturday \u003ca href=\"https://nerdsummit.org/#miles\"\u003eUsing AI as a Development Tool\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThis training is designed for those new to using AI in programming. It offers a comprehensive introduction to using AI as a coding assistant, covering everything from setting up AI tools to effectively utilizing them for coding tasks. With a focus on practical, hands-on learning, this guide is perfect for programmers of any level who are eager to explore the benefits of AI in their coding endeavors and enhance their programming skills.\u003c/p\u003e"
    ],
    [
      "women-in-tech",
      "8",
      "1",
      "white",
      "9:30 AM",
      "10:15 AM",
      "905",
      "Panel",
      "Women in IT and Tech ",
      "Tricia Canavan, CEO, Tech Foundry",
      "\u003cp\u003e Join us for an interactive discussion about Women in Tech: Strategies for Building a Strong Culture.\u003c/p\u003e\n\u003cp\u003ePanelists: \u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMarie-Ange Delimon, Community Impact Manager, Tech Foundry\u003c/li\u003e\n\u003cli\u003eBridget Haley, Director, MassMutual \u003c/li\u003e\n\u003cli\u003eShanice McKenzie, Digital Fellow, Tech Foundry\u003c/li\u003e\n\u003c/ul\u003e"
    ],
    [
      "aiken",
      "9",
      "1",
      "grey",
      "10:30 AM",
      "11:15 AM",
      "803",
      "Talk",
      "Intro to Infrastructure as Code",
      "Andrew Aiken",
      "\u003cp\u003eThe talk will cover the basics of infrastructure as code using Terraform.\u003c/p\u003e"
    ],
    [
      "10",
      "10",
      "1",
      "grey",
      "10:30 AM",
      "11:15 AM",
      "804",
      "Workshop",
      "Open Room",
      "Feel free to use this room.",
      "\u003cp\u003eFeel free to use this room if you like.\u003c/p\u003e"
    ],
    [
      "hakkarainen",
      "11",
      "1",
      "grey",
      "10:30 AM",
      "11:15 AM",
      "805",
      "Group discussion",
      "Techno-determinism",
      "Karl Hakkarainen",
      "\u003cp\u003eThe Luddites fought a losing battle against the machines of 19th century England. Ted Kaczynski made and mailed crude bombs in his effort to break the machines of the modern era. \nThese folks didn't fail because their tactics weren't good enough. Technology has, in the words of Langdon Winner, a \"self-propelling, self-sustaining, ineluctable flow.\"  We can direct that flow, but it will always find a path. \nSo goes the thinking of the technological determinists. Are they right? Are they evil? Do we have meaningful, enduring choices or are we just along for the ride?\u003c/p\u003e"
    ],
    [
      "12",
      "12",
      "1",
      "grey",
      "10:30 AM",
      "11:15 AM",
      "903",
      "Session",
      "Open Room",
      "Feel free to use this room.",
      "\u003cp\u003eFeel free to use this room if you like.\u003c/p\u003e"
    ],
    [
      "13",
      "13",
      "1",
      "grey",
      "10:30 AM",
      "5:00 PM",
      "904",
      "Workshop",
      "WORKSHOP: AI-Enhanced Coding: A Practical Workshop for All Levels  (Full Day)",
      "Michael Miles",
      "\u003cp\u003eSee description in 9:30AM slot\u003c/p\u003e"
    ],
    [
      "taaffe",
      "14",
      "1",
      "grey",
      "10:30 AM",
      "11:15 AM",
      "905",
      "Talk",
      "UX they expect: How contemporary design patterns can inform the UX of government services",
      "Molly Taaffe",
      "\u003cp\u003eIn this session we’ll take a look at how design patterns from popular websites can influence or be adapted to create effective experiences for government or non-profit organizations. We’ll use the White House Memo “Delivering a Digital-First Public Experience” to walk through ways we can meet customer expectations by using patterns they’ve become familiar with in their day-to-day lives, and the particular considerations civic technologists need to keep in mind.\u003c/p\u003e",
      "",
      "",
      "-"
    ],
    [
      "15",
      "15",
      "1",
      "blue",
      "11:30 AM",
      "12:45 PM",
      "2nd floor",
      "Lunch",
      "LUNCH BREAK",
      "",
      "\u003cp\u003eEat, drink and hangout!  Go to the 2nd floor to get to the food court\u003c/p\u003e\n \n",
      "",
      "",
      "-"
    ],
    [
      "David-Weinberger",
      "16",
      "1",
      "green",
      "1:00 PM",
      "2:00 PM",
      "Marriott Center ",
      "Keynote",
      "KEYNOTE: Knowledge without Understanding: The Light Cast by Our AI Nightmares\n",
      "David Weinberger",
      "\u003cp\u003eWe are thrilled to announce that our keynote speaker for Friday will be David Weinberger. David has been writing about the effect of technology on our ideas about ourselves and the world since the 1980s. His most recent book, the award-winning \u003ca href=\"https://everydaychaosbook.com/\" target=\"_blank\"\u003eEVERYDAY CHAOS,\u003c/a\u003e (HBR, 2019), presents a unique perspective on the rise and importance of machine learning.\u003c/p\u003e",
      "",
      "",
      "-",
      "",
      "keynote_2024_weinberger.png"
    ],
    [
      "fisher",
      "17",
      "1",
      "white",
      "2:15 PM",
      "3:00 PM",
      "803",
      "Talk",
      "Security in Drupal: what can go wrong?",
      "Benji Fisher",
      "\u003cp\u003eThe OWASP Top Ten is an industry standard list of the most common vulnerabilities that can affect web sites. This session will start with an overview of the Top Ten, and then take a more detailed look at a few of these vulnerabilities in the context of Drupal. We will review some actual Drupal security advisories.\u003c/p\u003e\n\u003cp\u003eThis session will help teach you about good \"web hygiene\" and what you can do to make your site more secure. It will also help you recognize when you need to rely on an expert.\u003c/p\u003e"
    ],
    [
      "raspberry-pi",
      "18",
      "1",
      "white",
      "2:15 PM",
      "5:00 PM",
      "804",
      "Workshop",
      "WORKSHOP: Microcontroller  introduction with Raspberry Pi Pico  (Half Day)",
      "Stephen Cross",
      "\u003cp\u003eTicket required see:  \u003ca href=\"https://ti.to/nerd/nerd-summit-2024-tickets#tito-ticket-training-microcontroller-introduction-with-raspberry-pi-pico\"\u003e TICKETS\u003c/a\u003e\n\u003cp\u003eA hands-on training with a Raspberry Pi microcontroller. Materials will be provided. A computer is required, so please bring your laptop.\u003c/p\u003e"
    ],
    [
      "19",
      "19",
      "1",
      "white",
      "2:15 PM",
      "3:00 PM",
      "805",
      "Session",
      "Open Room",
      "Feel free to use this room.",
      "\u003cp\u003eFeel free to use this room if you like.\u003c/p\u003e"
    ],
    [
      "sage",
      "20",
      "1",
      "white",
      "2:15 PM",
      "3:00 PM",
      "903",
      "Talk",
      "Disability Drives Design",
      "Sage Orville Shea",
      "\u003cp\u003eDisabled designers have long been some of the biggest movers and shakers in the field. Forced to constantly adapt to a world not built for them, disability has always driven innovation. From audiobooks in the 1930s to touch screens long before the first iPhone, countless technological advances have emerged from (not for) disabled communities. Yet, history has long repackaged these brilliant designers as recipients and users, not creators, of innovation. Why?\u003c/p\u003e\n\u003cp\u003eThis talk will cover the dark history that propelled the medical model of disability to its modern day prevalence, the Disabled Civil Rights Movement, the endless contributions disabled designers have made to our field, and steps your firm should take when approaching inclusive design. \u003c/p\u003e"
    ],
    [
      "21",
      "21",
      "1",
      "white",
      "2:15 PM",
      "5:00 PM",
      "904",
      "Workshop",
      "Open Room",
      "Feel free to use this room.",
      "\u003cp\u003eFeel free to use this room if you like.\u003c/p\u003e"
    ],
    [
      "sambor",
      "22",
      "1",
      "white",
      "2:15 PM",
      "3:00 PM",
      "905",
      "Talk",
      "Color in CSS: using new spaces, functions, and techniques to make your site shine",
      "Aubrey Sambor",
      "\u003cp\u003eWhen working with color on the web, we’ve always had a few choices. What are the new color options in CSS, and what do they add to the variety of color choices we already have? \u003c/p\u003e\n\u003cp\u003eIn this talk, I will discuss: \u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWhat’s new in the CSS Color Module Levels 4 and 5\u003c/li\u003e\n\u003cli\u003eAn overview of color spaces available today\u003c/li\u003e\n\u003cli\u003e How to use some of the new CSS color functions \u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAnd more!\u003c/p\u003e\n\u003cp\u003eAttendees will come away from this session with a deeper knowledge of the new color spaces and CSS color functions to make adding color to your site even easier!\u003c/p\u003e"
    ],
    [
      "23",
      "23",
      "1",
      "grey",
      "3:15 PM",
      "4:00 PM",
      "803",
      "Session",
      "Open Room",
      "Feel free to use this room.",
      "\u003cp\u003eFeel free to use this room if you like.\u003c/p\u003e"
    ],
    [
      "24",
      "24",
      "1",
      "grey",
      "2:15 PM",
      "5:00 PM",
      "804",
      "Workshop",
      "WORKSHOP: Microcontroller  introduction with Raspberry Pi Pico (Half Day)",
      "Stephen Cross",
      "\u003cp\u003eSee description in 2:15PM slot\u003c/p\u003e"
    ],
    [
      "mcIntosh",
      "25",
      "1",
      "grey",
      "3:15 PM",
      "4:00 PM",
      "805",
      "Talk",
      "HTMX Unleashed: Modern Web Tools Development with Minimal Effort and Maximum Impact",
      "Michael McIntosh",
      "\u003cp\u003eJoin us in for 'HTMX Unleashed' to learn how to leverage HTMX, a lightweight yet powerful JavaScript library, for simpler, more accessible web app development for ALL developers. We'll explore how HTMX enhances HTML for dynamic web pages, minimizing the need for complex JavaScript and dependencies. Discover the benefits of a HTMX tech stack using AlpineJS, TailwindCSS, and FastAPI. We'll present practical scenarios and showcase effective web tools developed with this stack. Attend 'HTMX Unleashed' for insights into efficient web development strategies that could enhance your projects.\u003c/p\u003e"
    ],
    [
      "rohrer",
      "26",
      "1",
      "grey",
      "3:15 PM",
      "4:00 PM",
      "903",
      "Talk",
      "Service to Startup: Lessons from the Military-to-Tech Transition",
      "JJ Rohrer",
      "\u003cp\u003eJoin us on an exploration of a journey from the disciplined military world to the dynamic startup scene. We'll share war stories from both fronts, highlighting the biases and blind-spots that were slowly and painfully uncovered, and eventually turned into tactical advantages. This talk is for everyone, regardless of background. Together, we'll bridge the gap between military tactics and startup strategies, providing fun and relatable insights for fellow techies eager to conquer the startup world.\u003c/p\u003e"
    ],
    [
      "27",
      "27",
      "1",
      "grey",
      "3:15 PM",
      "5:00 PM",
      "904",
      "Workshop",
      "Open Room",
      "Feel free to use this room.",
      "\u003cp\u003eFeel free to use this room if you like.\u003c/p\u003e"
    ],
    [
      "wahlund",
      "28",
      "1",
      "grey",
      "3:15 PM",
      "4:00 PM",
      "905",
      "Group discussion",
      "Let’s Chat about ChatGPT and Testing",
      "Jen Wahlund",
      "\u003cp\u003eFocusing on test data and test case writing, we’ll start with a review of what I recently learned at a conference and the few ways my team has used AI in our test case writing and testing, and we’ll then open up the discussion for sharing, questions, and trying some things out live on ChatGPT.\u003c/p\u003e"
    ],
    [
      "petruzella",
      "29",
      "1",
      "white",
      "4:15 PM",
      "5:00 PM",
      "803",
      "Talk",
      "Conversational Computing; or, how genAI reveals (and subverts) our HCI assumptions",
      "Gerol Petruzella",
      "\u003cp\u003eA year of running hands-on genAI workshops with multi-generational colleagues has surfaced what I think are important patterns in the idioms, mental models and folkways common among users whose formative computing experiences predate genAI. I'll share examples of these patterns and their implications; and I'll discuss how such implicit (but unexamined) mental models can mismatch our intentions in dealing with genAI. I hope to persuade you that effective genAI planning needs to start with a nuanced awareness of users' mental models of technology.\u003c/p\u003e"
    ],
    [
      "30",
      "30",
      "1",
      "white",
      "2:15 PM",
      "5:00 PM",
      "804",
      "Workshop",
      "WORKSHOP: Microcontroller  introduction with Raspberry Pi Pico  (Half Day)",
      "Stephen Cross",
      "\u003cp\u003eSee descitpion in 2:15PM slot\u003c/p\u003e"
    ],
    [
      "basiliere",
      "31",
      "1",
      "white",
      "4:15 PM",
      "5:00 PM",
      "805",
      "Group discussion",
      "Applying the Public Interest Technology Mindset  ",
      "Colette Basiliere",
      "\u003cp\u003ePublic Interest Technology (PIT) is an emerging field that asks us to create technical solutions that center the lives of people, equity, inclusion, and accountability to address pressing problems.  While PIT continues to grow, all technologists can learn how to approach problems like a public interest technologist to ensure technology works to serve and protect those who use it by delivering better outcomes.\u003c/p\u003e\n\u003cp\u003eThis discussion will introduce the practice of PIT and how everyone can critically assess technology's ethical and social implementation across all sectors. \u003c/p\u003e"
    ],
    [
      "32",
      "32",
      "1",
      "white",
      "4:15 PM",
      "5:00 PM",
      "903",
      "Session",
      "Open Room",
      "Feel free to use this room.",
      "\u003cp\u003eFeel free to use this room if you like.\u003c/p\u003e"
    ],
    [
      "33",
      "33",
      "1",
      "white",
      "4:15 PM",
      "5:00 PM",
      "904",
      "Workshop",
      "Open Room",
      "Feel free to use this room.",
      "\u003cp\u003eFeel free to use this room if you like.\u003c/p\u003e"
    ],
    [
      "nerds25-1",
      "34",
      "1",
      "white",
      "4:15 PM",
      "5:00 PM",
      "905",
      "Group discussion",
      "NERD Summit 2025",
      "Rick Hood, Kelly Albrecht",
      "\u003cp\u003ePlease come to discuss the future of NERD Summit.  We need to build the NERD Team to create a \"many hands make light work\" situation. \u003c/p\u003e\n\u003cp\u003eLink to handout \u003ca href=\"https://nerdsummit.org/pdf/NERD_Summit_2025_Session.pdf\"\u003eHERE\u003c/a\u003e."
    ],
    [
      "party",
      "35",
      "1",
      "blue",
      "5:00 PM",
      "9:00 PM",
      "Marriott Center ",
      "Party",
      "Friday Night Party",
      "Sponsored by Last Call Media",
      "\u003cp\u003eFood, drink and conversation.\u003c/p\u003e\n\u003cp\u003eTicket required:  \u003ca href=\"https://ti.to/nerd/nerd-summit-2024-tickets\"\u003eTICKETS\u003c/a\u003e\u003c/p\u003e\n \n",
      "",
      "",
      "-"
    ],
    [
      "36",
      "36",
      "2",
      "blue",
      "8:30 AM",
      "9:00 AM",
      "Marriott Center ",
      "Reception",
      "Registration & Reception",
      "Sponsored by Last Call Media",
      "\u003cp\u003eRegistration and continental breakfast\u003c/p\u003e",
      "",
      "",
      "-"
    ],
    [
      "37",
      "37",
      "2",
      "blue",
      "9:00 AM",
      "9:15 AM",
      "Marriott Center ",
      "Welcome",
      "Opening Remarks",
      "Rick Hood, Kelly Albrecht",
      "\u003cp\u003ePlease attend the welcome session for information and orientation about today's schedule.\u003c/p\u003e\n\u003cp\u003eNOTE: RAFFLING OFF THREE DRUPALIZE.ME MEMBERSHIPS: ONE ANNUAL AND TWO MONTHLY\u003c/p\u003e",
      "",
      "",
      "-"
    ],
    [
      "cross",
      "38",
      "2",
      "white",
      "9:30 AM",
      "10:15 AM",
      "803",
      "Talk",
      "Meet the Raspberry Pi",
      "Stephen Cross",
      "\u003cp\u003e\"Meet the Raspberry Pi\" will answer the questions \"What is a Raspberry Pi?\" and \"What can I use it for?\". This session will cover a brief history of the company and the mission behind this wildly successful credit-card-sized computer. We will review the Raspberry Pi models available and what you can use them for. And most importantly, how to get started.\u003c/p\u003e"
    ],
    [
      "39",
      "39",
      "2",
      "white",
      "9:30 AM",
      "10:15 AM",
      "804",
      "Workshop",
      "Open Room",
      "Feel free to use this room.",
      "\u003cp\u003eFeel free to use this room if you like.\u003c/p\u003e"
    ],
    [
      "ciak",
      "40",
      "2",
      "white",
      "9:30 AM",
      "10:15 AM",
      "805",
      "Talk",
      "Jobs for NERDs",
      "Anthony Ciak",
      "\u003cp\u003eThis is a session centered around partnering with a local IT recruiting & staffing agency as a candidate, best practices for job searching, networking, resume writing and interviews, etc.\u003c/p\u003e"
    ],
    [
      "ouellette-baya",
      "41",
      "2",
      "white",
      "9:30 AM",
      "10:15 AM",
      "903",
      "Talk",
      "WordPress Tips And Tricks With Matt and Nicole",
      "Nicole Ouellette & Matt Baya",
      "\u003cp\u003eWordPress is the most popular CMS online today, comprising around 30% of the world's websites. With over 30 years of WordPress experience combined, Matt Baya and Nicole Ouellette will talk about tips and tricks of WordPress you might not know both for website visitors and website administrators. They'll discuss their favorite themes and plugins, WordPress security, and functionality they've used with their clients (and themselves) to save time, give a better user experience, and otherwise make websites better.\u003c/p\u003e"
    ],
    [
      "make-it-glow",
      "42",
      "2",
      "white",
      "9:30 AM",
      "11:15 AM",
      "904",
      "Workshop",
      "WORKSHOP: INVENTURE: MAKE IT GLOW  (Half Day)",
      "Jessica Cobb",
      "\u003cp\u003eTicket required see:  \u003ca href=\"https://ti.to/nerd/nerd-summit-2024-tickets#tito-ticket-training-inventure-make-it-glow\"\u003e TICKETS\u003c/a\u003e\n\u003cp\u003eFor all ages! (children 6+, under 9 with a parent)\u003c/p\u003e\n\u003cp\u003e-No previous experience required-\u003c/p\u003e\n\u003cp\u003eMake a smart wearable by crafting flexible circuits without using conductive thread! In this no experience necessary workshop you will create a project where light is controlled through movement. You can choose to BYOP (Bring Your Own Project), or create your own custom designed smart textile!\u003c/p\u003e\n\u003cp\u003eFor more information about Jessica and these workshops, see this YouTube video:  \u003ca href=\"https://www.youtube.com/watch?v=d-7r37CAqNs\"\u003eInventure Workshops\u003c/a\u003e.  \n",
      "",
      "",
      "",
      "",
      "workshop_glow.jpg"
    ],
    [
      "autumn",
      "43",
      "2",
      "white",
      "9:30 AM",
      "10:15 AM",
      "905",
      "Talk",
      "Organized Chaos: The evolution of HTML, JS, CSS, and the Web",
      "Brian Autumn",
      "\u003cp\u003eBrian Autumn, Software Concept Accelerator, takes you on a journey from the very beginning of the web to the current day as he talks about how the core technologies of HTML, JS, and CSS have evolved. \u003c/p\u003e"
    ],
    [
      "bissex",
      "44",
      "2",
      "grey",
      "10:30 AM",
      "11:15 AM",
      "803",
      "Talk",
      "Defending dpaste.com from malicious users",
      "Paul Bissex",
      "\u003cp\u003eMy programmer pastebin site dpaste.com serves thousands of legitimate users every day, but like most web apps also attracts its share of spam, vulnerability probes, and other attacks. This talk details some of the techniques I use to mitigate these threats, and shows how I identify the problem requests for fast automated response. The site is a Python/Django app, but the deteection and mitigation techniques are applicable to any stack.\u003c/p\u003e"
    ],
    [
      "45",
      "45",
      "2",
      "grey",
      "10:30 AM",
      "11:15 AM",
      "804",
      "Workshop",
      "Open Room",
      "Feel free to use this room.",
      "\u003cp\u003eFeel free to use this room if you like.\u003c/p\u003e"
    ],
    [
      "duany",
      "46",
      "2",
      "grey",
      "10:30 AM",
      "11:15 AM",
      "805",
      "Group discussion",
      "Beginner Experience Highlights ",
      "Chakai Duany ",
      "\u003cp\u003eFirst timers often become overwhelmed with questions about experience. This group discussion will explore how to navigate this topic as a stepping stone towards building the opportunity to gain knowledge and anticipate solutions.\u003c/p\u003e"
    ],
    [
      "deck",
      "47",
      "2",
      "grey",
      "10:30 AM",
      "11:15 AM",
      "903",
      "Talk",
      "Your Own Private AI-daho: Using custom Local LLMs from the privacy of your own computer",
      "Ray Deck",
      "\u003cp\u003eYou can make your own Large Language Models - and work with them on your own computer! We will learn about the toolchain around GGML, GGUF and how to make private AI apps that run on your hardware - no fancy gamer rigs required!\u003c/p\u003e"
    ],
    [
      "48",
      "48",
      "2",
      "grey",
      "9:30 AM",
      "11:15 AM",
      "904",
      "Workshop",
      "WORKSHOP: INVENTURE: MAKE IT GLOW (Half Day)",
      "Jessica Cobb",
      "\u003cp\u003eSee description in 9:30AM slot\u003c/p\u003e"
    ],
    [
      "blossom",
      "49",
      "2",
      "grey",
      "10:30 AM",
      "11:15 AM",
      "905",
      "Talk",
      "Technical Resume Hacks: For When Recruiters Don't Know Their SaaS From Their Elbow",
      "Ivy Blossom",
      "\u003cp\u003eLearn how to grab the attention of recruiters and get them to understand the value you will add to their organization within just 6 seconds of looking at your resume with a unique approach to resume writing that takes you from overlooked to unforgettable. Includes a dozen examples from entry level to VP!\u003c/p\u003e",
      "",
      "",
      "-"
    ],
    [
      "50",
      "50",
      "2",
      "blue",
      "11:30 AM",
      "12:45 PM",
      "2nd floor",
      "Lunch",
      "LUNCH BREAK",
      "",
      "\u003cp\u003eEat, drink and hangout!  Go to the 2nd floor to get to the food court\u003c/p\u003e\n \n",
      "",
      "",
      "-"
    ],
    [
      "Jessica-Cobb",
      "51",
      "2",
      "green",
      "1:00 PM",
      "2:00 PM",
      "Marriott Center ",
      "Keynote",
      "KEYNOTE:  The Inventure Mindset: Future-fitness on the Frontier",
      "Jessica Cobb",
      "\u003cp\u003eJessica Cobb will be our keynote speaker on Saturday. This should be a fun one! Jessica is an international emerging technologist and the founder of \u003ca href=\"https://missioncontrollab.com/\"\u003eMISSION CONTROL LAB\u003c/a\u003e. She asserts that as agents of “inventure” we can cultivate future-fitness for ourselves, while influencing the causeways shared between humans, nature and machines.\u003c/p\u003e",
      "",
      "",
      "-",
      "",
      "keynote_2024_cobb.png"
    ],
    [
      "svrcek",
      "52",
      "2",
      "white",
      "2:15 PM",
      "3:00 PM",
      "803",
      "Talk",
      "Getting Going with Geospatial",
      "Joseph Svrcek",
      "\u003cp\u003eThis is an introduction to geospatial data.  Geospatial data is any kind of information that has geographic coordinates associated with it.  We'll discuss different geospatial data types, formats, services, and sources.  \u003c/p\u003e"
    ],
    [
      "53",
      "53",
      "2",
      "white",
      "2:15 PM",
      "3:00 PM",
      "804",
      "Workshop",
      "Open Room",
      "Feel free to use this room.",
      "\u003cp\u003eFeel free to use this room if you like.\u003c/p\u003e"
    ],
    [
      "goldsaito-2",
      "54",
      "2",
      "white",
      "2:15 PM",
      "3:00 PM",
      "805",
      "Talk",
      "Taking AI outside the chatbox",
      "Jonah Goldsaito",
      "\u003cp\u003eMost people’s first experiences with generative AI was in a chat context.\u003c/p\u003e\n\u003cp\u003eBut LLMs (the tech behind models like GPT4) can generate anything that can be represented in text, from SVGs, to chess moves, to whatever structured data you need in your app. \u003c/p\u003e\n\u003cp\u003ePrompt engineering is necessary, but mostly not technical at all, and we’ll start with the anatomy of a prompt. This expands much further when you chain prompts together to pull in or push out data (LangChain). \u003c/p\u003e\n\u003cp\u003eSuddenly anyone with a product hypothesis can rapidly prototype and validate complex user interactions. Let’s get you started.\u003c/p\u003e"
    ],
    [
      "buxton",
      "55",
      "2",
      "white",
      "2:15 PM",
      "3:00 PM",
      "903",
      "Talk",
      "Real World AI Applications: How to use AI language models to enhance relationships in Love, Life, and Work",
      "Ang Buxton",
      "\u003cp\u003eAng Buxton explores how to us Google Bard, Google's free AI language model, to strengthen (very human) relationships across romantic, platonic, and professional spheres. We'll explore practical ways to leverage Bard's capabilities through specific prompts, practical applications for the answers, and ultimately gain self-understanding, improve communication, and build deeper connections. \u003c/p\u003e"
    ],
    [
      "56",
      "56",
      "2",
      "white",
      "2:15 PM",
      "3:00 PM",
      "904",
      "Workshop",
      "Open Room",
      "Feel free to use this room.",
      "\u003cp\u003eFeel free to use this room if you like.\u003c/p\u003e"
    ],
    [
      "klapper",
      "57",
      "2",
      "white",
      "2:15 PM",
      "3:00 PM",
      "905",
      "Group discussion",
      "When good practices go bad",
      "Andy Klapper",
      "\u003cp\u003eSome times a good practice is overused, and in that overuse, results in less maintainable code.\u003c/p\u003e"
    ],
    [
      "ganssle",
      "58",
      "2",
      "grey",
      "3:15 PM",
      "4:00 PM",
      "803",
      "Talk",
      "Using a Progressive Web App to Teach My Son Absolute Pitch",
      "Paul Ganssle",
      "\u003cp\u003eAfter discovering the \"Eguchi Method\" for training children to have absolute or \"perfect\" pitch, I wanted to try it with my son, but I didn't have a convenient way to produce the chord sounds required by the method. In this talk, I'll discuss how — despite extremely limited experience with front-end development — I built a web app to solve my problem.\u003c/p\u003e"
    ],
    [
      "59",
      "59",
      "2",
      "grey",
      "3:15 PM",
      "4:00 PM",
      "804",
      "Workshop",
      "Open Room",
      "Feel free to use this room.",
      "\u003cp\u003eFeel free to use this room if you like.\u003c/p\u003e"
    ],
    [
      "neslund",
      "60",
      "2",
      "grey",
      "3:15 PM",
      "4:00 PM",
      "805",
      "Talk",
      "Let's Get Uncomfortable: How to Ask For and Process Feedback",
      "Cori Neslund",
      "\u003cp\u003eFor many of us, asking for and receiving feedback can be the most nerve-inducing part of our working lives. We often take a passive approach, which robs us of control over the impact we have on the teams, companies, and communities we are part of. \u003c/p\u003e\n\u003cp\u003eJoin this session to learn the step-by-step process of how to ask for and analyze feedback by going through a real example. Come see how turning fear of the unknown into a willingness for open conversation can empower us to take ownership of our future growth.\u003c/p\u003e\n\u003cp\u003e(And bring your questions!)\u003c/p\u003e"
    ],
    [
      "miles",
      "61",
      "2",
      "grey",
      "3:15 PM",
      "4:00 PM",
      "903",
      "Talk",
      "Using AI as a Development Tool",
      "Michael Miles",
      "\u003cp\u003eJoin us on an exploration of how generative AI tools are transforming development teams. This talk will div into practical use cases, from AI-powered ideation and code review to automating repetitive tasks, all designed to supercharge your development and team.\u003c/p\u003e"
    ],
    [
      "terra-forming",
      "62",
      "2",
      "grey",
      "3:15 PM",
      "5:00 PM",
      "904",
      "Workshop",
      "WORKSHOP: INVENTURE : TERRA-FORMING  (Half Day)",
      "Jessica Cobb",
      "\u003cp\u003eTicket required see:  \u003ca href=\"https://ti.to/nerd/nerd-summit-2024-tickets#tito-ticket-training-inventure-terra-forming\"\u003e TICKETS\u003c/a\u003e\n\u003cp\u003eFor all ages! (children 9+)\u003c/p\u003e\n\u003cp\u003e-No previous experience required-\u003c/p\u003e\n\u003cp\u003eBuild an interactive electronic fabitat where structures, stories and systems are signified using light, movement and sound without code. We will simulate and create a community booming with emerging technologies through exercises that grow creative communication through adapting and connecting through design challenges. Your project and parts go home with you!\u003c/p\u003e\n\u003cp\u003eFor more information about Jessica and these workshops, see this YouTube video:  \u003ca href=\"https://www.youtube.com/watch?v=d-7r37CAqNs\"\u003eInventure Workshops\u003c/a\u003e.  ",
      "",
      "",
      "",
      "",
      "workshop_terra.jpg"
    ],
    [
      "63",
      "63",
      "2",
      "grey",
      "3:15 PM",
      "4:00 PM",
      "905",
      "Session",
      "Open Room",
      "Feel free to use this room.",
      "\u003cp\u003eFeel free to use this room if you like.\u003c/p\u003e"
    ],
    [
      "nimbali",
      "64",
      "2",
      "white",
      "4:15 PM",
      "5:00 PM",
      "803",
      "Talk",
      "You're Hired: Decoding Interviews",
      "Shreya Nimbali",
      "\u003cp\u003eEver felt like interviews are a puzzle with missing pieces? Join this session to uncover what’s beyond the LeetCode clichés. Tech interviews are icebergs, with coding as just the tip. Learn to leverage job descriptions, navigate the six interview dimensions, and refine your approach. Bid farewell to the mundane STAR method for behavioral interviews; embrace a fresh perspective. As a junior in college and soon-to-be Amazon intern with two stints at Delta Air Lines, the speaker spills tea from interview trenches. Ready to ace your next interview? This session is your exclusive backstage pass.\u003c/p\u003e"
    ],
    [
      "65",
      "65",
      "2",
      "white",
      "4:15 PM",
      "5:00 PM",
      "804",
      "Workshop",
      "Open Room",
      "Feel free to use this room.",
      "\u003cp\u003eFeel free to use this room if you like.\u003c/p\u003e"
    ],
    [
      "goldsaito-1",
      "66",
      "2",
      "white",
      "4:15 PM",
      "5:00 PM",
      "805",
      "Talk",
      "An AR transmission from the future, launched at Tribeca",
      "Jonah Goldsaito",
      "\u003cp\u003eThis is the story of creating ReachYou, a piece of sci fi episodic communal art in augmented reality. An experiment in humane technology. And something made with pure joy.\u003c/p\u003e\n\u003cp\u003eReachYou was the product of a multi-generational nomadic experience. A rebirth of a live, software-assisted performance in Kazakhstan by the Goldsaitos. And a reaction to the ever growing attention economy and eventually our isolation (magnified by COVID). \u003c/p\u003e\n\u003cp\u003eJonah, the presenter, was the sole engineer, designer, and visual artist.\u003c/p\u003e\n\u003cp\u003eCome hear the story of its iterative creation and path to the Tribeca Film Festival.\u003c/p\u003e"
    ],
    [
      "67",
      "67",
      "2",
      "white",
      "4:15 PM",
      "5:00 PM",
      "903",
      "Session",
      "Open Room",
      "Feel free to use this room.",
      "\u003cp\u003eFeel free to use this room if you like.\u003c/p\u003e"
    ],
    [
      "68",
      "68",
      "2",
      "white",
      "3:15 PM",
      "5:00 PM",
      "904",
      "Workshop",
      "WORKSHOP: INVENTURE : TERRA-FORMING  (Half Day)",
      "Jessica Cobb",
      "\u003cp\u003eSee description in 3:15PM slot\u003c/p\u003e"
    ],
    [
      "nerds25-2",
      "69",
      "2",
      "white",
      "4:15 PM",
      "5:00 PM",
      "905",
      "Group discussion",
      "NERD Summit 2025",
      "Rick Hood, Kelly Albrecht",
      "\u003cp\u003ePlease come to discuss the future of NERD Summit.  We need to build the NERD Team to create a \"many hands make light work\" situation. \u003c/p\u003e\n\u003cp\u003eLink to handout \u003ca href=\"https://nerdsummit.org/pdf/NERD_Summit_2025_Session.pdf\"\u003eHERE\u003c/a\u003e."
    ],
    [
      "wrap",
      "70",
      "2",
      "blue",
      "5:00 PM",
      "6:00 PM",
      "Marriott Center ",
      "Wrap up",
      "WRAP UP / HANG OUT",
      "Rick Hood, Kelly Albrecht",
      "\u003cp\u003eCome hangout and share your experiences.\u003c/p\u003e\n \n"
    ]
  ]
}
