{
  "range": "CURRENT!A1:P1022",
  "majorDimension": "ROWS",
  "values": [
    [
      "id",
      "order",
      "day",
      "start",
      "end",
      "room",
      "type",
      "name",
      "speaker",
      "description",
      "speakerLink",
      "slideLink",
      "",
      "color",
      "zoom link"
    ],
    [
      "1",
      "1",
      "1",
      "8:30 AM",
      "9:15 AM",
      "Atrium",
      "Reception",
      "Registration & Reception",
      "Sponsored by Last Call Media",
      "\u003cp\u003eRegistration and continental breakfast\u003c/p\u003e",
      "",
      "",
      "-",
      "red"
    ],
    [
      "2",
      "2",
      "1",
      "9:15 AM",
      "9:45 AM",
      "135",
      "Welcome",
      "Opening Remarks",
      "Kelly Albrecht, Rick Hood",
      "\u003cp\u003ePlease attend the welcome session for information and orientation about today's schedule.\u003c/p\u003e",
      "",
      "",
      "-",
      "red"
    ],
    [
      "3",
      "3",
      "1",
      "10:00 AM",
      "10:45 AM",
      "135",
      "Talk",
      "Low cost websites with Plenti",
      "Jim Fisk",
      "\u003cp\u003ePlenti is an open source framework for building websites with the least amount of overhead possible. It gives developers the power to write simple HTML templates that automatically become editable by content maintainers without requiring technical expertise. It doesn't require you to run a server, as you can simply connect it to a git repository, and use static hosting with many free options available.\u003c/p\u003e",
      "",
      "",
      "",
      "red"
    ],
    [
      "4",
      "4",
      "1",
      "10:00 AM",
      "10:45 AM",
      "145",
      "Talk",
      "What's in my 'digital' bag? Cool tools I love to talk about but nobody asks",
      "Matthew Baya",
      "\u003cp\u003eI'm a geek, and thus I've found a number of cool (digital) tools over the years that have solved various problems for me, but it's pretty rare I find someone who wants to know more about them. But maybe, just maybe, you 'nerds' might be interested? In this 'Firehose' presentation I'll share a quick summary of these various tools, why I think they are cool, how I use them and where you can find out more information. These aren't coding tools, and one need not be a developer to appreciate them.\u003c/p\u003e\n\u003cp\u003eThe Tools:\u003c/p\u003e\n\u003cp\u003ePlex ( http://plex.tv )\u003c/p\u003e\n\u003cp\u003eVLC ( https://www.videolan.org/ )\u003c/p\u003e\n\u003cp\u003eRClone ( http://rclone.org )\u003c/p\u003e\n\u003cp\u003ePrivacy.com\u003c/p\u003e\n\u003cp\u003eTrueNAS Core ( https://www.truenas.com/truenas-core/ ) \u003c/p\u003e\n\u003cp\u003eIcecast ( https://icecast.org/ )\u003c/p\u003e",
      "",
      "",
      "",
      "blue"
    ],
    [
      "5",
      "5",
      "1",
      "10:00 AM",
      "10:45 AM",
      "221",
      "Talk",
      "Introduction to Accessibility ",
      "Yu-Li Hunsicker",
      "\u003cp\u003eThis presentation will be going over the fundamentals of what accessibility means and what web accessibility is. I’ll explain more about some basic accessibility guidelines and provide examples of ways to implement them on projects.  \u003c/p\u003e",
      "",
      "",
      "",
      "green"
    ],
    [
      "6",
      "6",
      "1",
      "10:00 AM",
      "11:45 AM",
      "241",
      "Training 1.75 hours",
      "Debugging at the Human Interface: what’s in your (dis)comfort zone?  | 10AM-11:45AM",
      "Audrey St. John & Becky Wai-Ling Packard",
      "\u003cp\u003eNote: the capacity of this room is 18 people.\u003c/p\u003e\n\u003cp\u003eTake a moment and imagine this: you’re settling in for the evening and… \u003c/p\u003e\n\u003cp\u003e… your dev environment prints an error message that makes you reexamine your parentheses. Simple fix! \u003c/p\u003e\n\u003cp\u003e… your work email pings with a message that makes you want to throw your phone. What now? \u003c/p\u003e\n\u003cp\u003eIn tech, we’re no strangers to the complexity of problem solving. We’re ready to use analytical skills to systematically track down and resolve unexpected behavior in our code. So why is it that unexpected human behavior can cause our own psychological systems to go on the fritz? \u003c/p\u003e\n\u003cp\u003eWe’re developing materials to unpack the factors that impact which situations are inside or outside of our comfort zone. You’ll port the debugging skills you’ve already been building for the world of code to the space of human interactions. This 90-minute session will troubleshoot some of the moments that can throw us off-balance and disrupt our lives in the workplace. \u003c/p\u003e"
    ],
    [
      "7",
      "7",
      "1",
      "10:00 AM",
      "10:45 AM",
      "321",
      "Talk",
      "What your server looks like on the cloud",
      "Josh Beauregard",
      "\u003cp\u003eA talk where I take apart a physical desktop computer, and go over the API equivalents on the big 3 clouds. Also go over what not needed on the cloud that is found on a desktop.\u003c/p\u003e",
      "",
      "",
      "",
      "yellow"
    ],
    [
      "8",
      "8",
      "1",
      "10:00 AM",
      "10:45 AM",
      "325",
      "Training",
      "Free Code Camp: A Guided Training For Beginners and Experts Alike  ALL DAY",
      "Chad Furman",
      "\u003cp\u003eLooking to explore a new career in tech?  Maybe you're in school and want to taste professional software development or get a certification?  Have a career and looking to expand your skillset?  We will have a professional software engineer available for the duration of Nerd Summit to help you get started and guide you if you get stuck.  By taking advantage of FreeCodeCamp.org's multiple learning tracks and certification programs that start at the beginning of Web Development, include machine learning and information security as well as modern frameworks like React, Redux, and Express, all the way through advanced coding challenges for job interviews, we can  provide learning opportunities and certifications for everyone.  Start where you're at, pick your path, pick your project, and continue when you get home -- there are no time limits, no cost, and you could end up with a new portfolio item or certification to put on your resume.  \u003c/p\u003e"
    ],
    [
      "9",
      "9",
      "1",
      "10:00 AM",
      "10:45 AM",
      "329",
      "Talk",
      "Paint by Pixel: An Introduction to Procedural Art Through WebGL and Fragment Shaders",
      "Jeff Peck",
      "\u003cp\u003eLearn how to get started with generation of computer artwork in fragment shaders. If you don't know what a fragment shader is (or are vaguely familiar), then this is the talk for you. I will cover setting up the environment  to make use of WebGL and the basics of shader language. We will talk about the signed distance function and present some primitive two-dimensional functions for making shapes, as well as the general notion that an entire picture can be expressed as a mathematical formula!\u003c/p\u003e\n\u003cp\u003eI will (possibly) include some live coding where we work through the generation of computerized art together. And I intend to cover some of the history of procedural art, from demoscene of the 1980s to shadertoy of today.\u003c/p\u003e\n\u003cp\u003eMuch of the talk will cover things that I have learned from Inigo Quilez. While I am no expert in this field, it is a something that is exciting for me, and I want to share what I have learned. It is my hope that attending this talk will inspire fascination with this wonderful world of procedural art, and to realize how it is very much within reach.\u003c/p\u003e",
      "",
      "",
      "",
      "orange "
    ],
    [
      "10",
      "10",
      "1",
      "11:00 AM",
      "11:45 AM",
      "135",
      "Talk",
      "Serendipitous Liquidators - Audiovisual Live Coding Improvisation",
      "Kosmas Giannoutakis and Aaron Juarez",
      "\u003cp\u003eIn the current turbulent sociopolitical landscape, a reflective contemplation on speculative post-modern futures is a necessity. Dominant notions in music/art-making, such as the genius artist and the musical/artwork, have been long questioned and critiqued, while alternative concepts of musicking and art-making are actively being evaluated in the network, digital, and computational art communities. Live coding is such a practice in which laptop performers code algorithmic processes that are manifested audiovisually in real time. The live coder is already accustomed to a configuration of relationships that include the fluid character of musical improvisation and remix culture, in combination with the identity of the computer musician as an improviser, collaborator, contributor, and commoner. In our approach, we reappropriate creative code by various artists, combined with our own interpretations and aesthetic histories. This practice which we term \"Serendipitous Liquidation,\" can be characterized as entangling its authors' computerized musicality or bringing their digital voices into a conversation. In that way, we propose an audiovisual experience that manifests a communitarian turn and brings closer a social reality based on digital commoning.\u003c/p\u003e\n\n\u003cp\u003eSerendipitous Liquidation describes the practice of live coding that reuses, remixes, and repurposes creative code by various authors in live performances. The limitless aesthetic possibilities of openly published code snippets are harnessed in experimental, improvisatory, and playful modes. This practice paves the way for the development of commons-centric ecosystems that are supported by Distributed Ledger Technologies. The performance engages with SuperCollider tweets and Hydra sketches composed by various creative coders. All the authors are cited on screen and in the credits.\u003c/p\u003e\n\n\u003cp\u003eIn this talk we are going to present our live coding practice and present with audiovisual examples and theoretical descriptions.\u003c/p\u003e",
      "",
      "",
      "",
      "red"
    ],
    [
      "11",
      "11",
      "1",
      "11:00 AM",
      "11:45 AM",
      "145",
      "Talk & Discussion",
      "Small Shop Proprietary Software in a Big Open Source World",
      "Donna DuSell & Michael Muller",
      "\u003cp\u003eThis interactive presentation will begin with the story of our small company and the website product developed over time to meet the needs of small businesses, non-profits, towns and other municipal entities.  It’s a tale of one man’s journey through tech beginning before the internet even existed and how the business model developed serves a wide variety of customers to this day.  Obviously we missed the boat of being bought out by Google or Microsoft!\u003c/p\u003e\n\n\u003cp\u003eOur goal in this session is to explore how our “small shop” software fits in with the current climate of large open source platforms.  We aren’t here to preach, we are here to share information and gain insights.  There are many web designers in the Valley, but we haven’t met any who are pedaling their home-made product; it can get lonely!\u003c/p\u003e\n\n\u003cp\u003eWe want to explore the benefits and drawbacks of proprietary vs. open source, share our experiences, and learn from others.\u003c/p\u003e",
      "",
      "",
      "",
      "blue"
    ],
    [
      "12",
      "12",
      "1",
      "11:00 AM",
      "11:45 AM",
      "221",
      "Talk",
      "Disability Drives Design",
      "Sage Orville Shea",
      "\u003cp\u003eDisabled designers have long been some of the biggest movers and shakers in the field. Forced to constantly adapt to a world not built for them, disability has always driven innovation. From audiobooks in the 1930s to touch screens long before the first iPhone, countless technological advances have emerged from (not for) disabled communities. Yet, history has long repackaged these brilliant designers as recipients and users, not creators, of innovation. Why?\u003c/p\u003e\n\n\u003cp\u003eThis talk will cover the dark history that propelled the medical model of disability to its modern day prevalence, the Disabled Civil Rights Movement, the endless contributions disabled designers have made to our field, and steps your firm should take when approaching inclusive design. \u003c/p\u003e",
      "",
      "",
      "",
      "green"
    ],
    [
      "14",
      "14",
      "1",
      "11:00 AM",
      "11:45 AM",
      "321",
      "Talk",
      "Migrating from Heroku to AWS",
      "Trevor Morris",
      "\u003cp\u003eOver the course of a year, we migrate the backend of notarize.com from Heroku to AWS-ECS.  The biggest hurdle was getting the state out of Heroku.  State obviously includes the databases (postgres and redis), but also hundreds of environment variables.  And, all of this spread across four environment (production, staging, etc.)  Another hurdle that we tackled was rebuilding the automation that comes out-of-the-box with Heroku.  The migration went very smoothly with just one scheduled off-hours outage to migrate the database.  Our solution includes terraform, AWS-ECS, and Jenkins.  I'll take you through our journey and share what we learned - both what went well, what didn't, and was it worth it.\u003c/p\u003e",
      "",
      "",
      "",
      "yellow"
    ],
    [
      "15",
      "15",
      "1",
      "11:00 AM",
      "11:45 AM",
      "325",
      "Training",
      "Free Code Camp: A Guided Training For Beginners and Experts Alike  ALL DAY",
      "Chad Furman",
      "\u003cp\u003eLooking to explore a new career in tech?  Maybe you're in school and want to taste professional software development or get a certification?  Have a career and looking to expand your skillset?  We will have a professional software engineer available for the duration of Nerd Summit to help you get started and guide you if you get stuck.  By taking advantage of FreeCodeCamp.org's multiple learning tracks and certification programs that start at the beginning of Web Development, include machine learning and information security as well as modern frameworks like React, Redux, and Express, all the way through advanced coding challenges for job interviews, we can  provide learning opportunities and certifications for everyone.  Start where you're at, pick your path, pick your project, and continue when you get home -- there are no time limits, no cost, and you could end up with a new portfolio item or certification to put on your resume.  \u003c/p\u003e"
    ],
    [
      "16",
      "16",
      "1",
      "11:00 AM",
      "11:45 AM",
      "329",
      "Talk",
      "Delete Your Code",
      "Mike Miles",
      "\u003cp\u003eAn active codebase is ever changing. Code is added, updated, optimized and sometimes deleted. That last action, deleting code, can be an intimidating one for developers. Deleting code feels permanent, absolute and hard to undo. It's simpler to comment out the code instead, so that, if needed, it can be quickly recovered. However doing this, can cause many headaches for developers, teams and projects.\u003c/p\u003e\n\u003cp\u003eDeleting code does not have to be scary, especially when using a code repository such as git. \u003c/p\u003e\n\u003cp\u003eThis talk will explain the benefits of deleting old code from a codebase, how to feel confident doing so and how to best utilize a git repository to keep track of and (if needed) restore deleted code.\u003c/p\u003e",
      "",
      "",
      "-",
      "orange "
    ],
    [
      "17",
      "17",
      "1",
      "12:00 PM",
      "12:45 PM",
      "Atrium",
      "Lunch",
      "LUNCH BREAK",
      "Sponsored by Last Call Media",
      "\u003cp\u003eEat, drink and hangout!\u003c/p\u003e\n \n",
      "",
      "",
      "-",
      "red"
    ],
    [
      "18",
      "18",
      "1",
      "1:00 PM",
      "2:00 PM",
      "135",
      "Keynote",
      "KEYNOTE: The Art Of Livecoding\n",
      "Char Stiles & Dan Gorelick, sponsored by Tag1",
      "\u003cp\u003eChar Stiles and Dan Gorelick will show us what livecoding is all about in The Art Of Livecoding! Join us for this innovative mix of technology, music, and art!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://mailchi.mp/3218c3c486fe/nerd-summit-5376024\"\u003eMore here\u003c/a\u003e\u003c/p\u003e",
      "",
      "",
      "-",
      "red"
    ],
    [
      "19",
      "19",
      "1",
      "2:15 PM",
      "3:00 PM",
      "135",
      "Talk",
      "A Tour of the Eighth Floor: Livecoding Music with Fennel and Renoise",
      "Ramsey Nasser",
      "\u003cp\u003eLivecoding is the practice of writing software on stage live in front of an audience, usually to generate music and visuals at parties we call Algoraves. 8FL (pronounced \"eighth floor\" or \"eight eff ell\" -- your choice) is a livecoding tool I've built for my performance practice and in this talk I will walk you through how it works and how I perform with it. 8FL is written in Lua and Fennel and runs inside of Renoise, but the intended audience is anyone with a general understanding of programming and no prior knowledge of any of the underlying technologies is assumed. I will take a first-principles approach, leveraging the live aspect of the tool to build up from simple expressions to a short track. Anyone interested in livecoding, algorithmic music, lisp, functional programming, sneaking REPLs into software, and unorthodox ways of using a computer will have a blast!\u003c/p\u003e",
      "",
      "",
      "",
      "red"
    ],
    [
      "20",
      "20",
      "1",
      "2:15 PM",
      "3:00 PM",
      "145",
      "Talk",
      "Jobs for NERDs",
      "Anthony Ciak",
      "\u003cp\u003eThis is a session centered around partnering with a staffing agency as a candidate, best practices for resume writing and interviews, etc. \u003c/p\u003e",
      "",
      "",
      "",
      "blue"
    ],
    [
      "21",
      "21",
      "1",
      "2:15 PM",
      "3:00 PM",
      "221",
      "Talk",
      "Listening as Leadership: Inclusive and Equitable Practices that Strengthen Diverse Teams",
      "Ang Buxton",
      "\u003cp\u003eObjective of this session: Understand inclusive practices and our role in them as leaders. Gain an arsenal of implementable strategies that lead to an equitable team and positive team culture.\u003c/p\u003e\n\u003cp\u003eLet's go beyond \"birds of a feather\" and ERGs and talk about what it means to lead a diverse (maybe even global!) team on a daily basis. How do we, as leaders, ensure what we're doing is inclusive? Equitable? How do we grow, and then more importantly, MAINTAIN, a diverse team? \u003c/p\u003e\n\u003cp\u003eStructure overview (subject to alterations):\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eIntro to session objectives - aligning on our Why \u003c/li\u003e\n\u003cli\u003eThink-Pair-Share - What does leadership look like? sound like? feel like? \u003c/li\u003e\n\u003cli\u003eListening as leadership concept \u003c/li\u003e\n\u003cli\u003eDiversity vs Equity vs Inclusion - what's the difference? who's it for? Think-Pair-Share - What are some of the advantages to having a diverse team? What are some of the challenges? \u003c/li\u003e\n\u003cli\u003eBuilding inclusive practices into your daily stand ups, weekly meetings and ceremonial events \u003c/li\u003e\n\u003cli\u003eBuilding equitable practices into your daily stand ups, weekly meetings and ceremonial events \u003c/li\u003e\n\u003cli\u003eGrowing a diverse team - the do's and dont's \u003c/li\u003e\n\u003cli\u003eMonitoring and Measuring success \u003c/li\u003e\n\u003cli\u003eQuestions and Resource share \u003c/li\u003e\n\u003c/ol\u003e\n\n\u003cp\u003eWith more time, I can build in more think-pair-shares and small group discussion activities. \u003c/p\u003e\n\n\u003cp\u003eA few examples of the strategies we will discuss: \u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eday-to-day team leadership - leading by example, the concept of \"everything speaks\" \u003c/li\u003e\n\u003cli\u003ethe power of one-on-ones \u003c/li\u003e\n\u003cli\u003ehow I've applied principles from Quantum Learning and Restorative Justice to my role as a team PM in tech \u003c/li\u003e\n\u003cli\u003eintentional scaffolding to set different experience levels up for success \u003c/li\u003e\n\u003cli\u003esetting up, and maintaining, procedures and structures for feedback \u003c/li\u003e\n\u003cli\u003eclarity of roles and career paths \u003c/li\u003e\n\u003cli\u003egrowing a diverse team - the do's and dont's of hiring \u003c/li\u003e\n\u003cli\u003eonline tools that help with equitable facilitation \u003c/li\u003e \u003c/ul\u003e\n\n",
      "",
      "",
      "",
      "green"
    ],
    [
      "22",
      "22",
      "1",
      "2:15 PM",
      "5:00 PM",
      "241",
      "Training 2.75 hours",
      "Live Coding with SuperCollider Tweets | 2:15PM-5PM",
      "Kosmas Giannoutakis",
      "\u003cp\u003eNote: the capacity of this room is 18 people.\u003c/p\u003e\n\u003cp\u003eSuperCollider Tweets are code snippets that used to have a maximum length limit of 140 characters (currently 280) and are shared on the social media platform Twitter. The tweets are meant to be copied and pasted to the native SuperCollider programming environment. Once executed, they produce music pieces of various degrees of duration, sonic intensity, and complexity. In the last 15 years, many composers and computer musicians have taken the challenge to exploit all kinds of shortcuts and syntactic sugar that the SuperCollider language provides to create code snippets that produce complex musical textures and sounds. The body of the SC tweets is an invaluable resource of diverse computer music with great artistic and educational potential.\u003c/p\u003e\n\n\u003cp\u003eIn this workshop, the participants will be introduced to an external library that allows the exploration and live manipulation of the SCTweets. A number of curated SCtweets will be analyzed and serve as the introduction to this live coding approach. The playing techniques of mixing, tweaking, self/hetero-modulation, and coupling will be described with various examples and practiced during the workshop. These techniques offer an effortless entry to complex sonic structures, making the coding experience rewarding and enjoyable. The workshop aims to introduce a live coding practice that reuses, remixes and repurposes published creative code by various authors in performative settings.\u003c/p\u003e\n\n\u003cp\u003eThis practice is theoretically described as \"Serendipitous Liquidation\" and can be characterized as entangling its authors' computerized musicality or bringing their digital voices into a conversation. In that way, I propose a sonic experience that manifests a communitarian turn and brings closer a musical reality based on digital commoning.\u003c/p\u003e",
      "",
      "",
      "",
      "green"
    ],
    [
      "23",
      "23",
      "1",
      "2:15 PM",
      "3:00 PM",
      "321",
      "Talk",
      "You Don’t Have to be a High School NERD to Enjoy Technology",
      "Sheila Slawiak",
      "\u003cp\u003eThis session will stress the importance of every student having the opportunity to work with a variety of technologies before they enter college. You will see first hand their artifacts that utilize a variety of technologies to demonstrate how innovative any high school student can be across a variety of subjects including oceanography, ancient civilizations, and music. These students will briefly present their journeys in designing and making their artifacts.\u003c/p\u003e",
      "",
      "",
      "",
      "yellow"
    ],
    [
      "24",
      "24",
      "1",
      "2:15 PM",
      "3:00 PM",
      "325",
      "Training",
      "Free Code Camp: A Guided Training For Beginners and Experts Alike  ALL DAY",
      "Chad Furman",
      "\u003cp\u003eLooking to explore a new career in tech?  Maybe you're in school and want to taste professional software development or get a certification?  Have a career and looking to expand your skillset?  We will have a professional software engineer available for the duration of Nerd Summit to help you get started and guide you if you get stuck.  By taking advantage of FreeCodeCamp.org's multiple learning tracks and certification programs that start at the beginning of Web Development, include machine learning and information security as well as modern frameworks like React, Redux, and Express, all the way through advanced coding challenges for job interviews, we can  provide learning opportunities and certifications for everyone.  Start where you're at, pick your path, pick your project, and continue when you get home -- there are no time limits, no cost, and you could end up with a new portfolio item or certification to put on your resume.  \u003c/p\u003e"
    ],
    [
      "25",
      "25",
      "1",
      "2:15 PM",
      "3:00 PM",
      "329",
      "Talk",
      "Blogging Beats Minimum Wage",
      "Tom Feeley",
      "\u003cp\u003eA discussion on how to start a blog that makes money.  Strategy, tactics, how to avoid pitfalls, and more.  Certainly room for questions.  Essentially a rundown on how to turn any topic into $\u003c/p\u003e",
      "",
      "",
      "",
      "orange "
    ],
    [
      "26",
      "26",
      "1",
      "3:15 PM",
      "4:00 PM",
      "135",
      "Panel",
      "The Best CMS",
      "Mike Miles",
      "\u003cp\u003eWhile we know there is no best CMS, this panel is about educating and comparing CMS options.\u003c/p\u003e\n\u003cp\u003ePanelists: Michael Miles, John Picozzi, Spencer Sherman, Alfred Nutile.\u003c/p\u003e",
      "",
      "",
      "",
      "red"
    ],
    [
      "27",
      "27",
      "1",
      "3:15 PM",
      "4:00 PM",
      "145",
      "Session",
      "Diversity, Recruitment, and Retention",
      "Ardeshir Pezeshk",
      "\u003cp\u003eIn fields like mechanical and software engineering and data analysis, employers often gripe about the competitive landscape around hiring and retention. And while they may want to make their teams more diverse, how can you get there if you can’t hire enough people? As generally understood, the problem is everyone wants to recruit and retain the best and brightest and there’s simply not enough of these persons. \u003c/p\u003e\n\u003cp\u003eIn this framework there’s an assumption that the ‘best and brightest’ come only from a select subset of universities. We disagree. They also come from more accessible and diverse institutions like Roxbury Community College, Springfield Technical Community College, and UMass-Boston. And if employers want  Black and Latine talent, they need to look at where they're being educated. \u003c/p\u003e\n\u003cp\u003eHack.Diversity’s mission is to transform the economy by breaking down barriers for Black and Latine/x professionals in tech. One way we do so is through our fellowship program where we recruit, develop and curate, and place tech talent from more equitable and accessible education pathways into innovative tech ecosystems. These pathways include self-learners, as well as those who attended and/or matriculated from community colleges, public two- and four-year universities, and bootcamps. \u003c/p\u003e\n\u003cp\u003eWe’d like to hear from you! Assuming a goal is building a more representative team, how are you going about doing so? How are you identifying the need? What strategies or processes are you embracing? Are they successful? And by what measure? Are you tracking your efforts and what effect, if any, are they having on hiring and retention? \u003c/p\u003e\n\u003cp\u003eWe look forward to lively and candid discussion on this topic. See you soon, NERDs. \u003c/p\u003e",
      "",
      "",
      "",
      "blue"
    ],
    [
      "28",
      "28",
      "1",
      "3:15 PM",
      "4:00 PM",
      "221",
      "Talk",
      "Accessibility-First Design and Development ",
      "Matthew Wright",
      "\u003cp\u003eAn overview of common site designs and functionalities which present unnecessary impediments for accessible use, and some suggested alternatives/best practices. In the same way smartphones created a mobile-first web, site designers and developers should recognize that, much like the importance of mobile UX, accessibility shouldn't continue to be an afterthought.\u003c/p\u003e",
      "",
      "",
      "",
      "green"
    ],
    [
      "30",
      "30",
      "1",
      "3:15 PM",
      "4:00 PM",
      "321",
      "Talk",
      "Surrealist Tone Setting",
      "Indira Ardolic",
      "\u003cp\u003eThis session will cover live coding with Unreal Engine 5 to build worlds and atmospheres during a collaboration. Look into one person's methods of setting up a scene and components to alter live. The goal is for attendees to have an idea of what might go into a live code performance using a game engine, and hopefully encourage more individuals who use Unreal Engine to use it creatively as a live performance tool. Unreal Engine has a wide array of tools within it, the focus will be on materials, lighting, and sourcing and preparing content.\u003c/p\u003e",
      "",
      "",
      "",
      "yellow"
    ],
    [
      "31",
      "31",
      "1",
      "3:15 PM",
      "4:00 PM",
      "325",
      "Training",
      "Free Code Camp: A Guided Training For Beginners and Experts Alike  ALL DAY",
      "Chad Furman",
      "\u003cp\u003eLooking to explore a new career in tech?  Maybe you're in school and want to taste professional software development or get a certification?  Have a career and looking to expand your skillset?  We will have a professional software engineer available for the duration of Nerd Summit to help you get started and guide you if you get stuck.  By taking advantage of FreeCodeCamp.org's multiple learning tracks and certification programs that start at the beginning of Web Development, include machine learning and information security as well as modern frameworks like React, Redux, and Express, all the way through advanced coding challenges for job interviews, we can  provide learning opportunities and certifications for everyone.  Start where you're at, pick your path, pick your project, and continue when you get home -- there are no time limits, no cost, and you could end up with a new portfolio item or certification to put on your resume.  \u003c/p\u003e",
      "",
      "",
      "",
      "yellow"
    ],
    [
      "32",
      "32",
      "1",
      "3:15 PM",
      "4:00 PM",
      "329",
      "Talk",
      "Learn About Node.js New Built-in Test Runner",
      "Gleb Bahmutov",
      "\u003cp\u003eJest, Mocha, Ava, and other Node test runners long dominated the unit testing. Now Node.js has released its own experimental unit testing framework. Learn how it compares to other test runners, which interesting features it provides, and if you should rewrite your tests to switch to the built-in \"test\" module.\u003c/p\u003e",
      "",
      "",
      "",
      "orange "
    ],
    [
      "33",
      "33",
      "1",
      "4:15 PM",
      "5:00 PM",
      "135",
      "Panel",
      "Becoming a Leader",
      "Matt Goodwin",
      "\u003cp\u003ePanelists: Kelly Albrecht(LastCall), Mike Miles(MIT) and KC Ceccarossi(CommonMedia)\u003c/p\u003e\n\u003cp\u003ePlease join me as I ask a panel of leaders questions about how they became leaders. We'll hear from them what lead them to become leaders and how others can become leaders too.\u003c/p\u003e",
      "",
      "",
      "",
      "red"
    ],
    [
      "34",
      "34",
      "1",
      "4:15 PM",
      "5:00 PM",
      "145",
      "Discussion",
      "The ABCs of QA. IOW, let’s talk about testing!",
      "Jen Wahlund",
      "\u003cp\u003eSome teams call it testing. Some call it quality assurance (QA). Some don’t have it at all. In this candid group discussion, we’ll talk about the pros & cons of different types of tests, communication & dynamics between testers and developers, and more. \u003c/p\u003e",
      "",
      "",
      "",
      "blue"
    ],
    [
      "35",
      "35",
      "1",
      "4:15 PM",
      "5:00 PM",
      "221",
      "Talk",
      "Toxic Instruments: Knitted Plastic Toys as Electronic Music Controllers ",
      "Emma Waddell & Sarika Doppalapudi",
      "\u003cp\u003eThis project examines the use of children’s toys, knitted using plastic bag waste, as electronic music controllers. More specifically, these toys function as inputs into a music generation algorithm written in SuperCollider. \u003c/p\u003e\n\u003cp\u003eSarika Doppalapudi will start off the talk. She will discuss her use of the medium of plastic yarn to create the toys. Furthermore, she will contextualize the toys within the broader academic and sociological implications that plastic has. Finally, she will consider the plastic toys as a means of creatively engaging with toxicity in the face of environmental destruction. \u003c/p\u003e\n\u003cp\u003eEmma Waddell will then lead a practical walkthrough of the SuperCollider code. They will discuss the use of Q-learning as a method to generate new musical sections based on user inputted patterns. Also, the methods the program uses to “listen” to live user inputs, and intelligently follow intensity changes over time. They will also touch on how this project fosters collaboration between humans and artificial intelligences with the goal of creating music through joint play.  \u003c/p\u003e\n\u003cp\u003eThe end of the talk will include a short recorded performance to show how the system works and how the plastic toy can be used to control the musical output. \u003c/p\u003e",
      "",
      "",
      "",
      "green"
    ],
    [
      "37",
      "37",
      "1",
      "4:15 PM",
      "5:00 PM",
      "321",
      "Talk",
      "Build a Web App that talks to ChatGPT using ChatGPT",
      "Alfred Nutile",
      "\u003cp\u003eJoin me for a 45 minute training on how to integrate ChatGPT into your web application, and see how it can bring a new level of interactivity and efficiency to your site.\u003c/p\u003e\n\u003cp\u003e You'll get a hands-on experience of building a Laravel PHP and Vue Inertia frontend to the API, using ChatGPT to create a seamless, natural language interface that your users will love. \u003c/p\u003e\n\u003cp\u003eDon't miss this opportunity to learn about the cutting-edge technology and discover how it can revolutionize your website's user experience. (written by ChatGPT)\u003c/p\u003e",
      "",
      "",
      "",
      "yellow"
    ],
    [
      "38",
      "38",
      "1",
      "4:15 PM",
      "5:00 PM",
      "325",
      "Training",
      "Free Code Camp: A Guided Training For Beginners and Experts Alike  ALL DAY",
      "Chad Furman",
      "\u003cp\u003eLooking to explore a new career in tech?  Maybe you're in school and want to taste professional software development or get a certification?  Have a career and looking to expand your skillset?  We will have a professional software engineer available for the duration of Nerd Summit to help you get started and guide you if you get stuck.  By taking advantage of FreeCodeCamp.org's multiple learning tracks and certification programs that start at the beginning of Web Development, include machine learning and information security as well as modern frameworks like React, Redux, and Express, all the way through advanced coding challenges for job interviews, we can  provide learning opportunities and certifications for everyone.  Start where you're at, pick your path, pick your project, and continue when you get home -- there are no time limits, no cost, and you could end up with a new portfolio item or certification to put on your resume.  \u003c/p\u003e",
      "",
      "",
      "",
      "yellow"
    ],
    [
      "39",
      "39",
      "1",
      "4:15 PM",
      "5:00 PM",
      "329",
      "Talk",
      "What's New With The Drupal Project Browser Initiative",
      "Leslie Glynn",
      "\u003cp\u003eThe Project Browser strategic Initiative's goal is to allow folks to easily browse for projects to add functionality to their Drupal website After browsing for projects (modules) compatible with the version of Drupal being used on the website, users will be able to download and install the projects from right within the website. The target audiences of the Project Browser are site builders and those new to Drupal. The initiative was highlighted by Dries in the Driesnote at DrupalCon Portland 2022 Come learn about the initiative and the ways you can contribute to this initiative.\u003c/p\u003e",
      "",
      "",
      "",
      "orange "
    ],
    [
      "40",
      "40",
      "1",
      "5:00 PM",
      "8:00 PM",
      "MARRIOTT CENTER",
      "Party",
      "AFTER PARTY",
      "Sponsored by Last Call Media",
      "\u003cp\u003eMore livecoding with Char & Dan.\u003c/p\u003e\n \n",
      "",
      "",
      "-",
      "red"
    ],
    [
      "41",
      "41",
      "2",
      "8:30 AM",
      "9:15 AM",
      "Atrium",
      "Reception",
      "Registration & Reception",
      "Sponsored by Last Call Media",
      "\u003cp\u003eRegistration and continental breakfast\u003c/p\u003e",
      "",
      "",
      "-",
      "red"
    ],
    [
      "42",
      "42",
      "2",
      "9:15 AM",
      "9:45 AM",
      "135",
      "Welcome",
      "Opening Remarks",
      "Kelly Albrecht, Rick Hood",
      "\u003cp\u003ePlease attend the welcome session for information and orientation about today's schedule.\u003c/p\u003e",
      "",
      "",
      "-",
      "red"
    ],
    [
      "43",
      "43",
      "2",
      "10:00 AM",
      "10:45 AM",
      "135",
      "Talk",
      "Publishing 101: Writing Books for Fun and Profit (But Mostly Fun)  | virtual speaker ",
      "Steven D. Brewer",
      "\u003cp\u003eThis speaker will be presenting from offsite via Zoom.\u003c/p\u003e \n\u003cp\u003ePublishing, like many other business models, has been disrupted by the Internet and e-commerce. It can be bewildering to make sense of the range of options available or how to get started. Brewer will provide an overview of the publishing industry landscape, discuss options for publication, and provide a roadmap to getting started.\u003c/p\u003e",
      "",
      "",
      "",
      "red"
    ],
    [
      "44",
      "44",
      "2",
      "10:00 AM",
      "10:45 AM",
      "145",
      "Discussion",
      "Back-End APIs for Modern Web Applications",
      "Paul Bissex",
      "\u003cp\u003eOnce upon a time, web applications lived on servers and sent rendered content to browsers.\u003c/p\u003e\n\u003cp\u003eNow, a common architecture is to have complex UI code running in the browser (e.g. React or Vue) , talking to a back-end via API calls (REST or GraphQL). \u003c/p\u003e\n\u003cp\u003eThe goal of this session is to bring together people who build and/or maintain web apps with this architecture, with a focus on the back-end (Rails, Django, Node, whatever). We'll talk about tools and techniques, challenges and wins, frameworks and languages, etc. \u003c/p\u003e\n\u003cp\u003ePossible topics: Handling authentication;  front-end versus back-end validation; deployment methods; API design; migrating legacy apps; hybrid legacy/modern apps; automated testing. \u003c/p\u003e",
      "",
      "",
      "",
      "blue"
    ],
    [
      "45",
      "45",
      "2",
      "10:00 AM",
      "10:45 AM",
      "221",
      "Talk",
      "Get going with CI/CD using GitHub in 10 minutes",
      "Alfred Nutile",
      "\u003cp\u003eWith one easy-to-read YAML file, you will learn how to use GitHub Actions for CI (Continuous Integration) and CD (Continuous Delivery). By the end of the lesson, your every push to GitHub will trigger PHPUnit tests, Selenium Tests (if you want), PHPCS, and PHPStan for static analysis, all taking less than 5 minutes. \u003c/p\u003e\n\u003cp\u003eAnd for those pushes to mainline, we will use a simple command to deploy your site to the server. \u003c/p\u003e\n\u003cp\u003eThis is an excellent solution for teams or solo developers.\u003c/p\u003e\n\u003cp\u003eWe will also set up a nightly OWASP security scan of your website. \u003c/p\u003e",
      "",
      "",
      "",
      "green"
    ],
    [
      "46",
      "46",
      "2",
      "10:00 AM",
      "11:45 AM",
      "241",
      "Training 1.75 hours",
      "Make Your Own Musical Instrument in the Browser | 10:00AM-11:45AM",
      "Joe Bacal",
      "\u003cp\u003eNote: the capacity of this room is 18 people.\u003c/p\u003e\n\u003cp\u003eYour browser is like an amazing Lego set with all kinds of fancy bricks that are just waiting for you to make something cool with.   In this session, we'll be playing with a subset of those bricks known as the web audio api.   We'll get a taste of how to use these modules together with html, css, and javascript to make cool audio toys like samplers, drum machines, and synths.  Beginners and advanced developers alike will get up and running with the basics, and leave with the knowledge and links they need to build something amazing.    \u003c/p\u003e",
      "",
      "",
      "",
      "green"
    ],
    [
      "47",
      "47",
      "2",
      "10:00 AM",
      "10:45 AM",
      "321",
      "Talk",
      "Lead Generation Ads And Your Tech Business",
      "Nicole Ouellette",
      "\u003cp\u003eEvery social media ad platform has the ability to run lead generation ads... and not only can you use this format to find more potential customers, you can also use it to test ideas in your business. This presentation will cover lead generation ads as a format with real examples about how they can be used by tech companies to grow an email list, find potential customers, and test products/services in the marketplace. \u003c/p\u003e",
      "",
      "",
      "",
      "yellow"
    ],
    [
      "48",
      "48",
      "2",
      "10:00 AM",
      "10:45 AM",
      "325",
      "Training",
      "Free Code Camp: A Guided Training For Beginners and Experts Alike",
      "Chad Furman",
      "\u003cp\u003eLooking to explore a new career in tech?  Maybe you're in school and want to taste professional software development or get a certification?  Have a career and looking to expand your skillset?  We will have a professional software engineer available for the duration of Nerd Summit to help you get started and guide you if you get stuck.  By taking advantage of FreeCodeCamp.org's multiple learning tracks and certification programs that start at the beginning of Web Development, include machine learning and information security as well as modern frameworks like React, Redux, and Express, all the way through advanced coding challenges for job interviews, we can  provide learning opportunities and certifications for everyone.  Start where you're at, pick your path, pick your project, and continue when you get home -- there are no time limits, no cost, and you could end up with a new portfolio item or certification to put on your resume.  \u003c/p\u003e",
      "",
      "",
      "",
      "yellow"
    ],
    [
      "49",
      "49",
      "2",
      "10:00 AM",
      "10:45 AM",
      "329",
      "Talk",
      "A journey from Developer to Manager",
      "Matt Goodwin",
      "\u003cp\u003eThis engaging session will provide advice and resources for developers who are considering a management position or former developers who have recently become managers.\u003c/p\u003e",
      "",
      "",
      "",
      "orange "
    ],
    [
      "50",
      "50",
      "2",
      "11:00 AM",
      "11:45 AM",
      "135",
      "Talk",
      "How to Make Your Code Reviewer Fall in Love with You",
      "Michael Lynch",
      "\u003cp\u003eWhen we talk about code reviews, we usually focus on what the reviewer should do. What about when you're the one writing the code?\u003c/p\u003e\n\u003cp\u003eAs the code author, your choices have a tremendous impact on the success of your review.\u003c/p\u003e\n\u003cp\u003eIn this session, you'll learn practical techniques you can apply to code reviews that will improve the quality of feedback you receive, minimize conflict with your teammates, and prevent code reviews from becoming a bottleneck.\u003c/p\u003e",
      "",
      "",
      "",
      "red"
    ],
    [
      "51",
      "51",
      "2",
      "11:00 AM",
      "11:45 AM",
      "145",
      "Talk",
      "Ethos behind my Home Automation Journey",
      "Nic Laflin",
      "\u003cp\u003eThis session will follow my journey in home automation including the devices and technology I chose and how it has evolved over the years.\u003c/p\u003e\n\u003cp\u003eI will include you in my thought process when evaluating and show some examples.\u003c/p\u003e\n\u003cp\u003eWe will explore the basic concepts of Home Assistant, Nodered, zwave, and ZwaveJStoMQTT.\u003c/p\u003e",
      "",
      "",
      "",
      "blue"
    ],
    [
      "52",
      "52",
      "2",
      "11:00 AM",
      "11:45 AM",
      "221",
      "Talk",
      "Stepping Outside the Box: Diversity in the Workplace Includes Employing Individuals Who Identify as Autistic",
      "Morgan Giosa",
      "\u003cp\u003eDid you know that around 1 in 68 people are diagnosed with an autism spectrum disorder? People with autism and Asperger's are becoming a growing part of civilization, and a growing part of the tech workforce, yet in spite of their high intelligence and remarkable creativity and passion, they often go unemployed and underemployed within our society.\u003c/p\u003e\n\u003cp\u003eThis presentation will attempt to debunk myths around autism and present autistic strengths and challenges, while also sharing why we believe it is important for Drupal firms and other employers to start considering accommodating potential employees with autism spectrum disorders.\u003c/p\u003e\n\u003cp\u003eThe presentation would cover the following topics/issues:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eDebunking the Myths surrounding the Autism diagnosis, which would include providing information about this diagnosis and how it might present in the workplace or in general, which would include providing statistics as to the percentage of autistic individuals who are in the tech field and what tech employers, including Microsoft, are offering them. \u003c/li\u003e\n\u003cli\u003eCovering the challenges and strengths of an individual on the spectrum and how his or her participation in the tech workforce could be a very good fit for this individual and the tech employer. \u003c/li\u003e\n\u003cli\u003eHow does the Americans with Disabilities Act (ADA) impact the tech employer when it is considering employing an individual who is on the Autism Spectrum. \u003c/li\u003e\n\u003cli\u003eWhat are some examples of reasonable accommodations that an employer should legally offer an employee or potential employee with autism under the ADA? \u003c/li\u003e\n\u003cli\u003eWhat are potential modifications to the workplace that the individual with autism wants an employer to offer even if the employer is not legally required to do so under the ADA.\u003c/li\u003e\u003c/ol\u003e",
      "",
      "",
      "",
      "green"
    ],
    [
      "54",
      "54",
      "2",
      "11:00 AM",
      "11:45 AM",
      "321",
      "Talk",
      "Writing sustainable automated tests",
      "Joshua Bolduc",
      "\u003cp\u003eAutomated tests are an essential part of any long-term project. However, the purpose of tests is also often misunderstood (spoiler: it’s not just for catching bugs). In this presentation, I’ll discuss the surprisingly nuanced relationship between unit, kernel and functional tests, the role of dependencies and why dependency injection is so important, how to identify code that is worthy of tests, and finally, how tests go hand-in-hand with great software design. By the end of this presentation you’ll have a better understanding of the true purpose of tests, and how to write tests that are sustainable, and offer value for the entire life of the project.\u003c/p\u003e",
      "",
      "",
      "",
      "yellow"
    ],
    [
      "55",
      "55",
      "2",
      "11:00 AM",
      "11:45 AM",
      "325",
      "Training",
      "Free Code Camp: A Guided Training For Beginners and Experts Alike",
      "Chad Furman",
      "\u003cp\u003eLooking to explore a new career in tech?  Maybe you're in school and want to taste professional software development or get a certification?  Have a career and looking to expand your skillset?  We will have a professional software engineer available for the duration of Nerd Summit to help you get started and guide you if you get stuck.  By taking advantage of FreeCodeCamp.org's multiple learning tracks and certification programs that start at the beginning of Web Development, include machine learning and information security as well as modern frameworks like React, Redux, and Express, all the way through advanced coding challenges for job interviews, we can  provide learning opportunities and certifications for everyone.  Start where you're at, pick your path, pick your project, and continue when you get home -- there are no time limits, no cost, and you could end up with a new portfolio item or certification to put on your resume.  \u003c/p\u003e",
      "",
      "",
      "",
      "yellow"
    ],
    [
      "56",
      "56",
      "2",
      "11:00 AM",
      "11:45 AM",
      "329",
      "Talk",
      "How to Identify, Accept and Celebrate Success When You Achieve It",
      "Tom Maher",
      "\u003cp\u003eIn the world of Software Development, it can be easy to overlook small wins as well as larger milestones. In this session, the presenter will share why and how recognizing successes can be impactful on your technical career and personal development. Through a series of personal stories and examples - stemming from 25+ years of experience - participants will learn practical tips, techniques and lessons learned that complement any development discipline.\u003c/p\u003e",
      "",
      "",
      "-",
      "orange "
    ],
    [
      "57",
      "57",
      "2",
      "12:00 PM",
      "12:45 PM",
      "Atrium",
      "Lunch",
      "LUNCH BREAK",
      "Sponsored by Last Call Media",
      "\u003cp\u003eEat, drink and hangout!\u003c/p\u003e\n \n",
      "",
      "",
      "-",
      "red"
    ],
    [
      "58",
      "58",
      "2",
      "1:00 PM",
      "2:00 PM",
      "135",
      "Keynote",
      "KEYNOTE:  Creativity Under Constraint",
      "Scott Bowman, sponsored by Knectar",
      "\u003cp\u003eCreativity Under Constraint, presented by Scott Bowman. Scott will show us the challenge and fun of being creative while working under constraint, using LEGO as a demonstration vehicle!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://mailchi.mp/1d7ba12aafb5/nerd-summit-5376396\"\u003eMore here\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eSponsored by \u003ca href=\"https://www.knectar.com/\" target=\"\"_blank\"\u003eKnectar\u003c/a\u003e ",
      "",
      "",
      "-",
      "red"
    ],
    [
      "59",
      "59",
      "2",
      "2:15 PM",
      "3:00 PM",
      "135",
      "Panel",
      "LEGO and Learning",
      "Nic Laflin",
      "\u003cp\u003eThis discussion focuses on how Lego is used as a tool for learning.  From earlier learners to seniors, Lego is used by parents, educators, and medical professionals to teach technical and life skills.\u003c/p\u003e\n\u003cp\u003ePanelists:  Joe Bacal, Scott Bownan, Adena Calden.\u003c/p\u003e",
      "",
      "",
      "",
      "red"
    ],
    [
      "60",
      "60",
      "2",
      "2:15 PM",
      "3:00 PM",
      "145",
      "Discussion",
      "CANCELLED  Drupal - Components and Layout Builder",
      "Jim Skowyra",
      "\u003cp\u003eA discussion regarding incorporating tools available in Drupal for designing and building components. Part of the discussion should focus on low-code solutions for site builders and custom blocks. Other areas include HTML/CSS and Twig templates.\u003c/p\u003e",
      "",
      "",
      "",
      "blue"
    ],
    [
      "61",
      "61",
      "2",
      "2:15 PM",
      "3:00 PM",
      "221",
      "Talk",
      "Underrepresented in Tech: Lessons from Competing in 100+ Hackathons",
      "Anita Yip",
      "\u003cp\u003eThere is no question, breaking into tech can be incredibly difficult for racial, gender, and socioeconomic minorities. Hackathons are the same way because they are microcosms of the tech industry, so it's not surprising to find that fewer than 25% of hackathon participants are female and little is known about other demographic factors and the intersectionality of them. \u003c/p\u003e\n\n\u003cp\u003eIn this session, hear from a first gen in tech about lessons learned from her hackathon journey. We'll touch on everything from the importance of showing up to the challenges of team formation to how to win at a hackathon -- without actually winning.\u003c/p\u003e",
      "",
      "",
      "",
      "green"
    ],
    [
      "62",
      "62",
      "2",
      "2:15 PM",
      "5:00 PM",
      "241",
      "Training 2.75 hours",
      "Microcontroller Introduction with Raspberry Pi Pico | 2:15PM-5PM |  LIMITED TO 12",
      "Stephen Cross",
      "\u003cp\u003eThis training requires a (free) ticket because it is limited to 12 people.  Tickets here:  \u003ca href=\"https://ti.to/nerd/nerd-summit-2023\"\u003ehttps://ti.to/nerd/nerd-summit-2023\u003c/a\u003e  \u003c/p\u003e\n\u003cp\u003e\"From light displays and IoT devices to signage and manufacturing processes, the Raspberry Pi Pico series gives you the power to control countless home, hobby, and industrial operations.\" - raspberrypi.com \u003c/p\u003e\n\u003cp\u003eMicrocontrollers are everywhere; in your washing machines, cameras, security alarms, smart devices, traffic lights, and more.   The Pi Pico is Rasberry Pi's microcontroller development board that makes computing accessible and affordable.  \u003c/p\u003e\n\u003cp\u003eThis training is a combination of lectures and hands-on exercises.  You will learn the following: \u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBasics of a microcontroller \u003c/li\u003e\n\u003cli\u003eCapabilities and features of the Raspberry Pi Pico \u003c/li\u003e\n\u003cli\u003eWays to use a microcontroller in your home \u003c/li\u003e\n\u003cli\u003eBasic electronic and physical computing concepts \u003c/li\u003e\n\u003cli\u003eHow to control the Pi Pico using Micropython \u003c/li\u003e\n\u003cli\u003eHow to write simple Micropython programs and install them on a Pi Pico \u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePre-Requisite: This is a beginner's training. There are two requirements to attend. 1. You have a laptop with a USB port running the latest version of your operating system. 2. A desire to learn.\u003c/p\u003e\n\u003cp\u003eMaterial provided: Raspberry Pi Pico, breadboard, USB Cable, LEDs, jumper wires and resistors. These materials will be available to take home for a small fee. \u003c/p\u003e\n",
      "",
      "",
      "",
      "green"
    ],
    [
      "63",
      "63",
      "2",
      "2:15 PM",
      "3:00 PM",
      "321",
      "Talk",
      "Transitioning to an API First Approach: Refactoring a museum interactive platform",
      "Rayvn Manuel",
      "\u003cp\u003eI am a strong proponent of APIs as the supporting technology for EVERY system which relies on the consumption of digital content.  New to API design, I decided that a \"trial by fire\" approach would be the optimum way to learn ALL that went into planning and implementing an API; an API with an internal and public interface; and a critical business requirement:  the successful  integration with an existing (Cerberus-protected) API. \u003c/p\u003e\n\n\u003cp\u003eMy 'trial' was to start small to permit the expected and numerous failed attempts. Yet knowing that every misfortune would lead to acquiring the tactical knowledge and practical skills transitioning to an API-first way-of-working.  The low-ish priority project I selected was the redesign of the in-gallery interactive platform.\u003c/p\u003e\n\n\u003cp\u003eI mean....I read all the appropriate books and attended the recommended industry conferences (and took notes). I followed this up by watching four (4) plus star-rated tutorials AND the resulting trivial task lists and twitter-like chats worked just as demonstrated by the instructors. \u003c/p\u003e\n\n\u003cp\u003eFeeling emotionally prepared - I shrugged (inwardly) and figured  'how hard could this be'?  Find out how I planned the journey along with a peek into the current challenges for this unfinished project. I will share the fist-pump moments, feelings of joy, and the developer's nemesis - exasperation. And most importantly, disclose the lessons learned taking these  baby-steps transitioning to an API-first approach to designing my first API. \u003c/p\u003e",
      "",
      "",
      "",
      "yellow"
    ],
    [
      "64",
      "64",
      "2",
      "2:15 PM",
      "3:00 PM",
      "325",
      "Training",
      "Free Code Camp: A Guided Training For Beginners and Experts Alike ALL DAY",
      "Chad Furman",
      "\u003cp\u003eLooking to explore a new career in tech?  Maybe you're in school and want to taste professional software development or get a certification?  Have a career and looking to expand your skillset?  We will have a professional software engineer available for the duration of Nerd Summit to help you get started and guide you if you get stuck.  By taking advantage of FreeCodeCamp.org's multiple learning tracks and certification programs that start at the beginning of Web Development, include machine learning and information security as well as modern frameworks like React, Redux, and Express, all the way through advanced coding challenges for job interviews, we can  provide learning opportunities and certifications for everyone.  Start where you're at, pick your path, pick your project, and continue when you get home -- there are no time limits, no cost, and you could end up with a new portfolio item or certification to put on your resume.  \u003c/p\u003e",
      "",
      "",
      "",
      "yellow"
    ],
    [
      "65",
      "65",
      "2",
      "2:15 PM",
      "3:00 PM",
      "329",
      "Talk",
      "How to Blow Up a Sprint: Bad Faith and the Possibility of Critical Resistance in Tech",
      "Jared MacFarlane & Asa Needle",
      "\u003cp\u003eOther technologists and I will lead an exploration of Jean Paul Sartre's notion of existential \"bad faith\" as it pertains to working within civic and corporate institutions. Within this frame, we will engage tech's entanglement with current matters in popular ethical discourse such as police violence, the gig economy, racial & gender equity, and more. Rather than merely proselytizing, we intend to explore the personal struggles and fulfillment that have come with attempting to live one's values through tech work.\u003c/p\u003e",
      "",
      "",
      "",
      "orange "
    ],
    [
      "66",
      "66",
      "2",
      "3:15 PM",
      "4:00 PM",
      "135",
      "Talk",
      "Security in Drupal: what can go wrong?",
      "Benji Fisher",
      "\u003cp\u003eThe OWASP Top Ten is an industry standard list of the most common vulnerabilities that can affect web sites. This session will start with an overview of the Top Ten, and then take a more detailed look at a few of these vulnerabilities and how they affect Drupal. We will review some actual Drupal security advisories:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWhat the vulnerability looks like \u003c/li\u003e\n\u003cli\u003eHow the Drupal security team communicates the problem \u003c/li\u003e\n\u003cli\u003eThe code that was updated to fix the problem \u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe presenter is a member of the Drupal security team.\u003c/p\u003e",
      "",
      "",
      "",
      "red"
    ],
    [
      "67",
      "67",
      "2",
      "3:15 PM",
      "4:00 PM",
      "145",
      "Discussion",
      "Make(r) Connections",
      "Andrew Pasquale",
      "\u003cp\u003eJoin a group discussion with local Makerspaces to hear about opportunities for makers in your community. \u003c/p\u003e\n\u003cp\u003eLocal Makerspaces will share about how they work in a round of lightning talks. Find out about tools, classes, and other resources that are available. After these short presentations, small group discussion topics will be selected by participants. \u003c/p\u003e\n\u003cp\u003eThis is also an opportunity for Makerspaces to share knowledge and best practices amongst each other and to discuss how people can be involved in the upcoming Pioneer Valley Maker Faire in October 2023.\u003c/p\u003e",
      "",
      "",
      "",
      "blue"
    ],
    [
      "68",
      "68",
      "2",
      "3:15 PM",
      "4:00 PM",
      "221",
      "Talk",
      "Win Friends and Influence People on Slack",
      "Clayton Salem",
      "\u003cp\u003eA discussion on the challenges of being a remote employee at a hybrid or office based company. I’ll frame the discussion around personality and privilege. We’ll explore one on one slack chats, video calls, email, and show some ways you can make yourself heard, even when you’re too far to shout.\u003c/p\u003e",
      "",
      "",
      "",
      "green"
    ],
    [
      "70",
      "70",
      "2",
      "3:15 PM",
      "4:00 PM",
      "321",
      "Talk",
      "From Java to Kotlin: migrating microservices at Grindr",
      "Amy Lashley",
      "\u003cp\u003eIn 2021, Grindr (the largest social networking app for LGBTQ+ people) made the decision to halt an ongoing Java monolith to microservice migration, and switch to Kotlin. In this session we will cover the reasoning for moving to Kotlin and how this was accomplished. We will examine the impact Kotlin has had on app performance and development time. We’ll also talk about some tools and libraries that are integral to our implementation, including the framework (Ktor) and testing library (Kotest) we use.\u003c/p\u003e",
      "",
      "",
      "",
      "yellow"
    ],
    [
      "71",
      "71",
      "2",
      "3:15 PM",
      "5:00 PM",
      "325",
      "Training",
      "Design within Constraint Engagement Activity | 2 hours",
      "Scott Bowman",
      "\u003cp\u003eThis is a follow up session/training from Scott's Creativity Under Constraint 1:00PM keynote talk.  More info TBA.\u003c/p\u003e",
      "",
      "",
      "",
      "yellow"
    ],
    [
      "72",
      "72",
      "2",
      "3:15 PM",
      "4:00 PM",
      "329",
      "Talk",
      "Managing a remote app development team (or any other kind)",
      "Erik Britt-Webb",
      "\u003cp\u003eHave challenges managing an app development team (or any other) that is spread out across countries and time zones? Have challenging gathering, organizing, prioritizing, planning and executing a backlog of bug fixes and enhancements? Wish you could establish more fluid communication that spanned from detailed tasks to big picture discussions? This talk will offer perspectives from an executive who has managed far-flung teams as small as a few people working on a start-up to a 1000 business unit inside a 200,000 person company. It will cover a range of technologies, best practices and philosophies that have worked across these various contexts. \u003c/p\u003e",
      "",
      "",
      "",
      "orange "
    ],
    [
      "73",
      "73",
      "2",
      "4:15 PM",
      "5:00 PM",
      "135",
      "Talk/Panel",
      "Diversity in Tech: Hiring for and Building an Inclusive Culture",
      "Tricia Canavan & The Tech Foundry",
      "\u003cp\u003eDiscussion and/or presentation regarding building an inclusive culture through hiring and employee engagement best practices.\u003c/p\u003e",
      "",
      "",
      "",
      "red"
    ],
    [
      "74",
      "74",
      "2",
      "4:15 PM",
      "5:00 PM",
      "145",
      "Discussion",
      "Make(r) Connections (continued from 3:15)",
      "Andrew Pasquale",
      "\u003cp\u003eJoin a group discussion with local Makerspaces to hear about opportunities for makers in your community. \u003c/p\u003e\n\u003cp\u003eLocal Makerspaces will share about how they work in a round of lightning talks. Find out about tools, classes, and other resources that are available. After these short presentations, small group discussion topics will be selected by participants. \u003c/p\u003e\n\u003cp\u003eThis is also an opportunity for Makerspaces to share knowledge and best practices amongst each other and to discuss how people can be involved in the upcoming Pioneer Valley Maker Faire in October 2023.\u003c/p\u003e",
      "",
      "",
      "",
      "blue"
    ],
    [
      "75",
      "75",
      "2",
      "4:15 PM",
      "5:00 PM",
      "221",
      "Talk",
      "Search Engine Optimization and ethics in our postmodern \"post-truth\" age",
      "Damien McKenna",
      "\u003cp\u003eSearch Engine Optimization is as important today as it was in the early, heady days of search engines, when people were focused on making their content visible to potential readers or customers. Today, however, we have to contend with fake product reviews, fake products, fake news articles, fake publications from fake agencies, fake videos from fake advocacy groups, fake social media posts from fake friends, real statements from legit institutions based on fake data - it's getting increasingly harder to both promote legitimate content in a sea of fakeness, and entice visitors who can't tell the difference between Elvis sightings and 1960's rock 'n roll music enthusiasts in dressup.\u003c/p\u003e\n\n\u003cp\u003eWhile Elvis may be dead, the basic foundations of search engine optimization live on. Join me as we take a step through contemporary SEO practices and look beyond to how to make our content still relevant in a world of fakery.\u003c/p\u003e",
      "",
      "",
      "",
      "green"
    ],
    [
      "77",
      "77",
      "2",
      "4:15 PM",
      "5:00 PM",
      "321",
      "Talk",
      "Full stack web development with RedwoodJs",
      "Krishna Guruswamy",
      "\u003cp\u003eOverview of Redwoodjs features, advantages over other frameworks and workflows\u003c/p\u003e",
      "",
      "",
      "",
      "yellow"
    ],
    [
      "79",
      "79",
      "2",
      "4:15 PM",
      "5:00 PM",
      "329",
      "Open",
      "OPEN",
      "TBD",
      "\u003cp\u003eSession, discussion or panel description here.\u003c/p\u003e",
      "",
      "",
      "",
      "orange "
    ],
    [
      "80",
      "80",
      "2",
      "5:00 PM",
      "6:00 PM",
      "Atrium",
      "Wrap up",
      "WRAP UP / HANG OUT",
      "",
      "\u003cp\u003eInfo on wrap up activities posted soon.\u003c/p\u003e\n \n",
      "",
      "",
      "",
      "red"
    ]
  ]
}
